-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Фев 07 2023 г., 16:57
-- Версия сервера: 8.0.30
-- Версия PHP: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `test-task`
--

-- --------------------------------------------------------

--
-- Структура таблицы `city`
--

CREATE TABLE `city` (
  `id` int NOT NULL,
  `name` text COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `city`
--

INSERT INTO `city` (`id`, `name`) VALUES
(1, 'Ростов-на-Дону'),
(2, 'Москва'),
(5, 'Ставрополь'),
(6, 'Ставрополь'),
(7, 'Санкт-Петербург'),
(8, 'Новосибирск'),
(9, 'Санкт-Петербург'),
(10, 'Новосибирск'),
(11, 'Екатеринбург'),
(12, 'Казань'),
(13, 'Нижний Новгород'),
(14, 'Челябинск'),
(15, 'Красноярск'),
(16, 'Самара'),
(17, 'Уфа'),
(18, 'Омск'),
(19, 'Краснодар'),
(20, 'Воронеж'),
(21, 'Волгоград'),
(22, 'Пермь'),
(23, 'Тюмень'),
(24, 'Тольятти'),
(25, 'Ижевск'),
(26, 'Барнаул'),
(27, 'Ульяновск'),
(28, 'Иркутск'),
(29, 'Хабаровск'),
(30, 'Махачкала'),
(31, 'Ярославль'),
(32, 'Владивосток'),
(33, 'Оренбург'),
(34, 'Томск'),
(35, 'Кемерово'),
(36, 'Новокузнецк'),
(37, 'Рязань'),
(38, 'Набережные Челны'),
(39, 'Астрахань'),
(40, 'Киров'),
(41, 'Пенза'),
(42, 'Севастополь'),
(43, 'Балашиха'),
(44, 'Липецк'),
(45, 'Чебоксары'),
(46, 'Чебоксары'),
(47, 'Калининград'),
(48, 'Тула'),
(49, 'Курск'),
(50, 'Улан-Удэ'),
(51, 'Сочи'),
(52, 'Тверь'),
(53, 'Магнитогорск'),
(54, 'Иваново'),
(55, 'Брянск'),
(56, 'Белгород'),
(57, 'Сургут'),
(58, 'Владимир'),
(59, 'Чита'),
(60, 'Архангельск'),
(61, 'Нижний Тагил'),
(62, 'Симферополь'),
(63, 'Калуга'),
(64, 'Якутск'),
(65, 'Грозный'),
(66, 'Волжский'),
(67, 'Смоленск'),
(68, 'Саранск'),
(69, 'Череповец'),
(70, 'Курган'),
(71, 'Подольск'),
(72, 'Вологда'),
(73, 'Орёл'),
(74, 'Владикавказ'),
(75, 'Тамбов'),
(76, 'Мурманск'),
(77, 'Петрозаводск'),
(78, 'Нижневартовск'),
(79, 'Кострома'),
(80, 'Йошкар-Ола'),
(81, 'Новороссийск'),
(82, 'Стерлитамак'),
(83, 'Химки'),
(84, 'Таганрог'),
(85, 'Мытищи'),
(86, 'Сыктывкар'),
(87, 'Комсомольск-на-Амуре'),
(88, 'Нижнекамск'),
(89, 'Нальчик'),
(90, 'Шахты'),
(91, 'Дзержинск'),
(92, 'Энгельс'),
(93, 'Благовещенск'),
(94, 'Королёв'),
(95, 'Братск'),
(96, 'Орск'),
(97, 'Ангарск'),
(98, 'Псков'),
(99, 'Люберцы'),
(100, 'Бийск'),
(101, 'Прокопьевск');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `city`
--
ALTER TABLE `city`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `city`
--
ALTER TABLE `city`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=102;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
